//算术运算符：加:+ 、减:- 、乘:* 、除:/ 、取余:%
#include<stdio.h>

int main()
{
    //1. 加减乘：+ - *
    //1.1数字直接计算
    printf("%d\n", 3 + 2);
    printf("%d\n", 3 - 2);
    printf("%d\n", 3 * 2);

    printf("%.2lf\n", 1.1 + 1.01);
    printf("%.2lf\n", 1.1 - 1.01);
    printf("%.2lf\n", 1.1 * 1.01);

    //1.2变量进行运算
    int a = 3;
    int b = 4;
    printf("%d\n", a + b);

    //2.除法与取余：/ %
    printf("%d\n", 10 / 2); // 5
    printf("%d\n", 10 % 2); // 0
    printf("%d\n", 10 % 3); // 1
    
    //通用细节：
    //1：整数运算，结果一定是整数
    printf("%d\n", b / a);  // 1
    printf("%d\n", 10 / 3); // 3

    //2：小数运算，结果一定是小数
    printf("%lf\n", 10.1 + 3.0);

    //3：整数和小数运算，结果一定是小数
    printf("%lf\n", 10 / 3.0);

    //4：小数直接参与计算，结果有可能不精确
    printf("%lf\n", 3.33333333 + 6.66666666);//打印结果：10.000000
    printf("%.20lf\n", 10.0 / 3.0);//打印结果：3.33333333333333350000

    //除法的细节：1.不能除以0；
              // 2.int类型除法的结果若为小数，则直接去掉小数部分。
    //printf("%d\n", 10 / 0);

    //取余的细节：
    //1.运算数据必须全部为整数;
    //2.获取余数的正负，是跟第一个数字保持一致的。
    printf("%d\n", 10 % 3);//1
    printf("%d\n",-10 % 3);//-1
    printf("%d\n",10 % -3);//1
    //3.不能除以0

    return 0;
}