//自增自减运算符：自增运算符：++ ；自减运算符：-- 
/*
自增自减运算符作用：1.简化代码：a++等价于a = a + 1；
2.比如淘宝购买的商品数,数字旁边的+与-就是自增自减运算符；
3.循环语句里；4.……
*/
#include<stdio.h>

int main()
{
    //++即可以放到变量前面(先加加)，也可以放到变量后面(后加加)
    //1.如果单独写一行，放前面与放后面的结果都一样(--同理)，实际开发工作时基本都是单独写一行的情形
    //注意，第10节的逗号运算符效果跟单独写一行效果一致
    int a = 10;
    int b = 15;
    a++;
    printf("%d\n", a);//11
    ++a;
    printf("%d\n", a);//12
    --b;
    printf("%d\n", b);//14
    b--;
    printf("%d\n", b);//13
    printf("------------------------\n");

    //2.如果不单独写一行,即自增自减运算符参与运算(注意实际开发中基本不用),此时先加加与后加加有区别
    //2.1先加加：
    int c = 10;
    int d = c++;//先用后加，即先把a的值先赋值给d，再自增，故此时d的值为10而不是11，而c的值为11；
    printf("%d\n", d);//10
    printf("%d\n", c);//11
    printf("------------------------\n");

    //2.2后加加：
    int e = 20;
    int f = ++e;//先加后用，即将e值进行自增，然后赋值给f，此时f与e的值都为21；
    printf("%d\n", f);//21
    printf("%d\n", e);//21
    printf("------------------------\n");

    //以下关于自增自减运算符参与复杂运算时，不同系统不一样，所以实际开发中基本不用，了解即可
    int i = 10;
    int j = 5;
    int k = i++ + ++i - --j - i--;
    printf("%d\n", k);//6

    return 0;
}