"""
类型转换：
一、隐式转换：在进行运算时自动就转换类型，比如 True + 10 就是将布尔类型True转成整数类型1进行计算；
二、显式转换：
    1.int(x)：将x转换成整数类型；
    2.float(x)：将x转换成浮点数类型；
    3.str(x)：将x转换成字符串类型；
    4.chr(x)：将x转换成一个字符；
    5.ord(x)：将x转换成对应的整数值；
    6.hex(x)：将x转换成十六进制字符串；
    7.oct(x)：将x转换成八进制字符串；
    8.bin(x)：将x转换成二进制字符串；
"""
### 示例1 隐式转换
print("--------------------- 示例1 -------------------------")
x=10
y=3
z=x/y # 在执行除法运算的时候，将运算的结果赋值给z
print(z,type(z)) # 隐式转换，通过运算隐式的转换了结果的类型

# 将str转成int类型
print(int('100')+int('200'))


###### 显示转换
### 示例2 数字类型显式转换
print("--------------------- 示例2 -------------------------")
# float类型转成int类型，即只保留整数部分
print('float类型转成int类型:',int(3.14))
print('float类型转成int类型:',int(-3.14))

# 将int转成float类型
print('将int转成float类型:',float(10))

### 示例3 数字、字符、字符串之间显式转换
print("--------------------- 示例3 -------------------------")
# 将字符串转成int或float时报错的情况如下：
# print(int('18a')) # ValueError: invalid literal for int() with base 10: '18a'
# print(int('3.14')) # ValueError: invalid literal for int() with base 10: '3.14'

# 将int转换成字符串str类型
j=1
i=str(j)
print(i,type(i))

# chr()ord()一对互为相反的操作
print(ord('张')) # 张在unicode表中对应的整数值
print((chr(24352))) # 26472整数在unicode表中对应的字符是什么

### 示例4 进制之间的显式转换操作，十进制与其它进制之间的转换
print("--------------------- 示例4 -------------------------")
print('十进制转成十六进制：',hex(24352))
print('十进制转成八进制：',oct(24352))
print('十进制转成二进制：',bin(24352))