"""
一、常用的运算符：
    1.算术运算符：+、-、*、/、//、%、**；
    2.赋值运算符：=、+=、-=、*=、/=、//=、%=、**=；
    3.比较运算符：>、>=、<、<=、==、!=；
    4.逻辑运算符：and、or、not；
    5.位运算符：&、|、^、~、<<、>>
运算符的优先级(中间见课程P23)：括号() > 幂运算** > ... > 比较运算符 > 赋值运算符
"""

### 示例1 算术运算符的使用
print("--------------------- 示例1 -------------------------")
print('加法：',1+1)
print('减法：',1-1)
print('乘法：',2*3)
print('除法：',10/2) # 5.0，是一个浮点数float
print('整除：',10//3) # 3,是一个整数int
print('取余',10%3)
print('幂运算',2**4) # 2*2*2*2
# 算术运算符优先级跟数学一致

### 示例2 赋值运算符的使用
print("--------------------- 示例2 -------------------------")
x=20 # 直接将20赋值给左侧的变量x
y=10
x=x+y # 将x+y的和赋值给x,x值为30
print(x)
x+=y # 40,相当于x=x+y
print(x)
x-=y # 相当于x=x-y
print(x)
x*=y # 相当于x=x*y
print(x)
x/=y #相当于x=x/y
print(x)
x%=2 #相当于x=x%2
print(x)
z=3
y//=z # 相当于y=y//z
print(y)
y**=2 # 相当于y=y**2
print(y)

#python支持链式赋值
a=b=c=100 # 相当于a=100,b=100,c=100
print(a,b,c)

# python支持系列解包赋值
a,b=10,20 # 相当于执行了a=10,b=20
print(a,b)

print('---如何交换两个变量的值呢？---')
a,b=b,a # 将b的值赋给a,将a的值赋给b
print(a,b)

### 示例3 比较运算符的使用
print("--------------------- 示例3 -------------------------")
print('98大于90吗?',98>90)
print('98小于90吗?',98<90)
print('98等于90吗?',98==90)
print('98不等于90吗?',98!=90)
print('98大于等于90吗?',98>=90)
print('98小于等于90吗?',98<=90)

### 示例4 逻辑运算符的使用(与and、或or、非not)
print("--------------------- 示例4 -------------------------")
print(True and True)
print(True and False)
print(False and False)
print(False and True)
print()

print(8>7 and 6>5)
print(8<7 and 10/0) # 10/0没有运算，因为当第一个表达式的结果为False，直接得结果，不会计算and右侧的表达式了
# print(10/0 and 8<7) # ZeroDivisionError: division by zero
print()

print(True or True)
print(True or False)
print(False or False)
print(False or True)
print()

print(8>7 or 10/0) # 左侧表达式结果为Ture时，or的右侧表达式根本不执行运算符
print()

print(not True)
print(not False)
print(not(8>7))

### 示例5 位运算符的使用
print("--------------------- 示例5 -------------------------")
# 位运算符是把数字看作二进制数来进行各种操作运算(具体见课程P23)
print('按位与运算:',12&8) # 8
print('按位或运算:',4|8)  # 12
print('按位异或运算:',31^9) # 22
print('按位取反运算:',~123) # -124
print('左移位运算:',4<<3) # 表示4转换成二进制再向左移动3位后再转换成十进制
print('右移位运算:',8>>2) # 表示8转换成二进制再向右移动2位后再转换成十进制