/*
一、数组的索引：就是数组的一个编号，也叫作：角标、下标、编号

二、特点:1.从0开始，连续+1，不间断(这与python一样都是从0开始)
        2.索引的范围：最小索引 = 0；最大索引 = 数组长度 - 1。

三、元素的访问(获取)与修改格式：
    访问：变量 = 数组名[索引]
    修改：数组名[索引] = 数据值

四、数组的遍历：依次获取数组中的每一个元素
    方法：利用循环，具体见示例2

*/
#include <stdio.h>

int main()
{
    // 示例1 数组元素的访问与修改
    printf("------------- 示例1 --------------\n");
    int arr[] = {1, 2, 3, 4, 5};

    // 访问
    int num1 = arr[0];
    int num2 = arr[2];
    int num3 = arr[4];
    int sum = num1 + num2 + num3;
    printf("%d\n", sum);

    // 修改
    printf("\n修改前：%d\n", arr[4]);
    arr[4] = 10;
    printf("修改后：%d\n", arr[4]);


    // 示例2 数组的遍历
    printf("------------- 示例2 --------------\n");
    int arr2[5] = {1, 2, 3, 4, 5};

    // 获取数组长度。(具体原因见第3节的第五部分)
    int len = sizeof(arr2) / sizeof(int);  
    printf("数组长度：%d\n", len);

    // 利用循环遍历
    for (int i = 0; i < len; i++)
    {
        printf("%d\n", arr2[i]);
    }


    return 0;
}