/*
数组排序：冒泡排序、选择排序
    注：以下均以从小到大排列为主

1.冒泡排序：相邻的数据两两比较，小的放前面，大的放后面，依次类推

2.选择排序：从索引0开始，拿着每一个索引上的元素跟后面的元素依次比较，小的放后面，大的前面，依次类推
            跟冒泡排序的正好相反，比如冒泡排序先排最大的，而选择排序则先排最小的(反之亦然)
*/
#include<stdio.h>

int main()
{
    // 示例1 冒泡排序
    printf("------------- 示例1 --------------\n");  
    // 1.定义数组
    int arr[] = {3,5,2,1,4};
    int len = sizeof(arr) / sizeof(int);    

    // 2.利用冒泡排序，把数组中的数据按照升序排列
    // 外循环：第i轮排序的循环
    for (int i = 0; i < len - 1; i++)
    {
        // 内循环：进行第i轮排序的数组遍历比较循环
        for (int j = 0; j < len-1-i; j++) // 注意:-1是避免因为28行代码arr[j+1]导致数组索引越界
        {
            // 相邻的元素两两比较。小的在前面，大的在后面
            if (arr[j] > arr[j+1])
            {
                int temp = arr[j];
                arr[j] = arr[j+1];
                arr[j+1] = temp;
            }
        }
    }

    // 3.遍历数组
    for (int i = 0; i < len; i++)
    {
        printf("%d\n", arr[i]);
    }


    // 示例2 选择排序
    printf("------------- 示例2 --------------\n");  
    // 1.定义数组
    int arr2[] = {3,5,2,1,4};    
    int len2 = sizeof(arr2) / sizeof(int);

    // 2.利用选择排序，把数组中的数据按照升序排列
    // 外循环：索引遍历循环
    for (int i = 0; i < len2 - 1; i++) // 注意：-1是因为最后一个索引不需要再进行比较排列了
    {
        // 内循环：第i个索引上的元素跟后面的元素j依次比较的循环
        for (int j = i + 1; j < len2; j++) 
        {
            // 相邻的元素两两比较。小的在前面，大的在后面
            if (arr2[i] > arr2[j])
            {
                int temp = arr2[i];
                arr2[i] = arr2[j];
                arr2[j] = temp;
            }
        }
    }

    // 3.遍历数组
    for (int i = 0; i < len2; i++)
    {
        printf("%d\n", arr2[i]);
    }


    return 0;
}