"""
递归函数：在一个函数的函数体内调用该函数本身，该函数就是递归函数

递归操作：一个完整的递归操作由两部分组成，一部分是递归调用，一部分是递归终止条件，一般可用if来判断

优缺点：优点：思路和代码简单
        缺点：占用内存较多，效率较慢。因为每次调用函数就会开辟一个新的栈帧，从而占用内存较大
"""
### 示例1 阶乘递归
print("--------------------- 示例1 -------------------------")
## 阶乘操作：n!=n*(n-1)!=n*(n-1)*(n-2)!=...=n*(n-1)*(n-2)*...*2*1
def fac(n):  
    if n==1:  # 阶乘递归结束条件
        return 1
    else:
        return n * fac(n-1)  # 此处用到递归操作
    
print(fac(5)) # 120
print(fac(7)) # 5040


### 示例2 斐波那契数列
print("--------------------- 示例2 -------------------------")
# 递推公式：f(n) = f(n-1) + f(n-2)
def fac2(n):
    if n==1 or n==2:
        return 1
    else:
        return fac2(n-1) + fac2(n-2)
    
print(fac2(9)) # 34

# 打印斐波那契数列的前9个数字
for i in range(1,10):
    print(fac2(i), end='\t') 