/*
二级指针和多级指针：
    1，定义：因为指针变量本身也占有内存地址,所以指向指针的指针便称为二级指针,同理可延伸到多级指针。

    2.二级指针格式：数据类型** 指针名       # 二级指针的数据类型跟指针保持一致。

    3.作用：二级指针可以操作一级指针记录的地址

    4.应用场景：
        (1)数组中使用(见第6节)
        (2)对于空指针(即指针赋值为NULL，也就是指向的内存空间是空的)，可以用二级指针来指向该空指针，
            然后给二级指针解引用赋值，从而给空指针赋值，这在动态内存分配里经常用到(见示例2)。
*/
#include<stdio.h>
#include<stdlib.h>

// 示例2用到的函数
void fun(int** temp);  // 形参为二级指针，指向空指针p的内存地址


int main()
{
    // 示例1 二级指针
    printf("------------- 示例1 --------------\n"); 
    // 定义变量
    int a5 = 10;
    int b5 = 20;

    // 定义一级指针
    int* p5 = &a5;

    // 定义二级指针
    int** pp = &p5;

    // 输出打印
    printf("%p\n", &a5); // 000000000061FE0C
    printf("%p\n", &b5); // 000000000061FE08
    printf("%p\n", p5);  // 000000000061FE0C

    // 作用1：利用二级指针修改一级指针里面记录的内存地址并打印
    *pp = &b5;
    printf("%p\n", p5);  // 000000000061FE08

    // 作用2：利用二级指针获取到变量中记录的数据
    printf("%d\n", **pp); // 20  


    // 示例2 动态内存分配中使用二级指针
    printf("------------- 示例2 --------------\n"); 
    // 定义一个空指针p
    int* p = NULL;  

    // 调用函数fun，传入指针变量p的地址
    fun(&p);

    // 打印*p的值
    printf("%d\n", *p);

    // 释放内存
    free(p);

    // 通过示例2的例子可知，如果不使用二级指针而是一级指针p，则会报错



    return 0;
}


// 示例2用到的函数
void fun(int** temp)  // 形参为二级指针，指向空指针p的内存地址
{
    // 解引用二级指针temp进行赋值，即给传递的指针p赋值给堆内存空间的首地址
    *temp = (int*)malloc(sizeof(int));

    // 解引用指针p(即**temp)进行100的赋值
    **temp = 100;
}