/*
一、二维数组：数组的元素本身也是数组，即把多个小数组放到一个大数组中。(多维数组同理)

二、二维数组的格式：
    格式一(条件：一维数组长度必须完全一致)：
        数据类型 arr[m][n] =     
        {
            {1,2,3,...},
            {1,2,3,...},
            ...
            {1,2,3,...}     # 特别注意：最后一个小数组无逗号
        }
            其中：m为二维数组的长度(大数组元素个数)、n为一维数组的长度(小数组元素个数)

    格式二：方法是先把所有的一维数组定义完毕，再放到二维数组中(具体见示例2)：
        数据类型 arr1[n_1] = {1,2,...};
        数据类型 arr2[n_2] = {1,2,...};
        ...
        数据类型 arrm[n_m] = {1,2,...};
        数据类型* arr[m] = {arr1, arr2,..., arrm}    
            # 特别注意：arr[m]存储的元素都是内存地址(因为由第5节，参与运算的数组会退化为指针)

三、二维数组的遍历：
    1.索引遍历(见示例1和示例2)
    2.指针遍历(见第7节的示例1和示例2)
*/
#include<stdio.h>

int main()
{
    // 示例1 二维数组第一种格式与索引遍历
    printf("------------- 示例1 --------------\n");   
    // 1.定义二维数组
    int arr_1[3][5] = 
    {
        {1,2,3,4,5},
        {11,22,33,44,55},
        {111,222,333,444,555}
    };

    // 2.利用索引的方式进行遍历
    // 外循环：遍历二维数组元素，其中i为二维数组的元素索引
    for (int i = 0; i < 3; i++)
    {
        // 内循环：遍历每一个一维数组，其中j表示一维数组里的元素索引
        for (int j = 0; j < 5; j++)
        {
            printf("%d ", arr_1[i][j]);  // 注意：用空格进行分隔而表示换行\n
        }
        // 内循环结果表示一行的一维数组遍历完毕，此时需要换行遍历下一个一维数组
        printf("\n");
    }


    // 示例2 二维数组第二种格式与索引遍历
    printf("------------- 示例2 --------------\n"); 
    // 1.定义三个一维数组和数组长度
    int arr1[3] = {1,2,3};
    int arr2[5] = {1,2,3,4,5};
    int arr3[9] = {1,2,3,4,5,6,7,8,9};

    // 预先计算每个数组长度并合并
    int len1 = sizeof(arr1) / sizeof(int);
    int len2 = sizeof(arr2) / sizeof(int);
    int len3 = sizeof(arr3) / sizeof(int);
    int lenArr[3] = {len1, len2, len3};


    // 2.把三个一维数组放到二维数组当中
    int* arr_2[3] = {arr1, arr2, arr3}; // 注：arr_2存储的是各一维数组的首地址，故*不能丢

    // 3.利用索引遍历arr
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < lenArr[i]; j++)
        {
            printf("%d ", arr_2[i][j]);
        }
        printf("\n");
    }



    return 0;
}